applications/test/compressible/poiseuilleFlow/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fixedWalls
    {
        type            calculated;
        value           $internalField;
    }

    velocity-inlet
    {
        type            calculated;
        value           $internalField;
    }

    velocity-outlet
    {
        type            calculated;
        value           $internalField;
    }
    
    frontAndBack
    {
        type            empty;
    }
    
}

// ************************************************************************* //
