applications/test/compressible/poiseuilleFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (5 0 0)
    (5 1 0)
    (0 1 0)
    (0 0 0.1)
    (5 0 0.1)
    (5 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 30 1) 
    simpleGrading (
        1
        (
            (0.5 0.5 2)
            (0.5 0.5 0.5)
        )
        3)
);

edges
(
);

boundary
(
    velocity-inlet
    {
        type cyclic;
        neighbourPatch velocity-outlet;
        faces
        (
            (0 4 7 3)
        );
    }

    velocity-outlet
    {
        type cyclic;
        neighbourPatch velocity-inlet;
        faces
        (
            (1 5 6 2)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
